In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame
import glob
import os

In [2]:
#mathematical operations as well as statistical operations like mean median mode sdev variance libraries
import statistics
import math

In [3]:
#data plotting library
import seaborn as sns
import matplotlib.pyplot as plt

In [4]:
os.chdir("D://Business analytics//Excel class//Python//files")

In [5]:
path = os.getcwd()
csv_files = glob.glob(os.path.join(path,"*.csv"))
append_data = []
for x in csv_files:
    df = pd.read_csv(x)
    df.columns = df.iloc[1]
    df = df.iloc[2:].reset_index(drop= True)
    append_data.append(df)
df_final = pd.concat(append_data)
df_final = df_final[['Date','channelKey', 'ProductKey','UnitCost', 'UnitPrice', 'SalesQuantity','ReturnQuantity', 'ReturnAmount', 'DiscountQuantity', 'DiscountAmount',
       'TotalCost', 'SalesAmount', 'GeographyKey']]
df_final.columns

C:\Users\om\AppData\Local\Temp\ipykernel_5344\390765909.py:5: DtypeWarning: Columns (0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(x)
C:\Users\om\AppData\Local\Temp\ipykernel_5344\390765909.py:5: DtypeWarning: Columns (0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(x)
C:\Users\om\AppData\Local\Temp\ipykernel_5344\390765909.py:5: DtypeWarning: Columns (0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(x)

Index(['Date', 'channelKey', 'ProductKey', 'UnitCost', 'UnitPrice',
       'SalesQuantity', 'ReturnQuantity', 'ReturnAmount', 'DiscountQuantity',
       'DiscountAmount', 'TotalCost', 'SalesAmount', 'GeographyKey'],
      dtype='object', name=1)

In [6]:
xls = pd.ExcelFile("lookup1.xlsx")
product = pd.read_excel(xls,"Product")
geography = pd.read_excel(xls,"Geography")
channel = pd.read_excel(xls,"Channel")
geography

     GeographyKey  ContinentName
0             738         Europe
1             424  North America
2             586         Europe
3             840  North America
4             710           Asia
..            ...            ...
258           820  North America
259           905  North America
260           719           Asia
261           762         Europe
262           779         Europe

[263 rows x 2 columns]

In [7]:
#casting for unitprice and unitcost values
df_final[["channelKey","ProductKey","GeographyKey"]] = df_final[["channelKey","ProductKey","GeographyKey"]].astype(int)
df_final[['UnitCost', 'UnitPrice',
       'SalesQuantity', 'ReturnQuantity', 'ReturnAmount', 'DiscountQuantity',
       'DiscountAmount', 'TotalCost', 'SalesAmount']] = df_final[['UnitCost', 'UnitPrice',
       'SalesQuantity', 'ReturnQuantity', 'ReturnAmount', 'DiscountQuantity',
       'DiscountAmount', 'TotalCost', 'SalesAmount']].astype(float)

In [8]:
df_final1 = pd.merge(df_final,product,how = "left",left_on = "ProductKey",right_on = "ProductKey")
df_final1 = pd.merge(df_final1,channel,how ="left",left_on= "channelKey",right_on = "ChannelKey")
df_final1 = pd.merge(df_final1,geography,how= "left",left_on = "GeographyKey",right_on = "GeographyKey")

df_final1 = df_final1.drop(columns =["channelKey","ProductKey","GeographyKey","ChannelKey"])
df_final1

,Date,UnitCost,UnitPrice,SalesQuantity,ReturnQuantity,ReturnAmount,DiscountQuantity,DiscountAmount,TotalCost,SalesAmount,ProductName,Sub category,Category,ChannelName,ContinentName
0,01-01-2014,73.12,159.00,9.0,0.0,0.00,0.0,0.000,658.08,1431.000,Proseware Photo Ink Jet Printer M100 White,"Printers, Scanners & Fax",Computers,Store,North America
1,01-01-2014,509.32,999.00,3.0,1.0,999.00,1.0,149.850,1527.96,2847.150,Litware Washer & Dryer 15.5in E150 Green,Washers & Dryers,Home Appliances,Store,Asia
2,01-01-2014,16.31,32.00,4.0,0.0,0.00,7.0,11.200,65.24,116.800,MGS Age of Empires II: The Conquerors Expansio...,Download Games,Games and Toys,Online,North America
3,01-01-2014,105.77,230.00,18.0,0.0,0.00,1.0,11.500,1903.86,4128.500,"The Phone Company Touch Screen Phones 26-2.2"" ...",Touch Screen Phones,Cell phones,Online,North America
4,01-01-2014,1.71,3.35,80.0,1.0,3.35,0.0,0.000,136.80,268.000,Contoso In-Line Coupler E180 Silver,Cell phones Accessories,Cell phones,Store,North America
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859500,31-12-2016,208.40,629.00,8.0,0.0,0.00,3.0,377.400,1667.20,4654.600,Fabrikam SLR Camera X146 Black,Digital SLR Cameras,Cameras and camcorders,Store,Europe
859501,31-12-2016,222.98,673.00,6.0,0.0,0.00,3.0,403.800,1337.88,3634.200,Contoso SLR Camera X144 Gold,Digital SLR Cameras,Cameras and camcorders,Store,North America
859502,31-12-2016,123.24,268.00,13.0,0.0,0.00,4.0,214.400,1602.12,3269.600,"The Phone Company Touch Screen Phones 26-1.4"" ...",Touch Screen Phones,Cell phones,Catalog,North America
859503,31-12-2016,210.72,635.99,24.0,1.0,635.99,10.0,953.985,5057.28,14309.775,Adventure Works Floor Lamp X1150 Silver,Lamps,Home Appliances,Online,Asia
859504,31-12-2016,195.24,382.95,13.0,1.0,382.95,4.0,229.770,2342.88,4748.580,Adventure Works Laptop12 M1201 Silver,Laptops,Computers,Store,Asia

In [9]:
Stats = df_final1[["Date","UnitCost","UnitPrice","SalesAmount"]]
Stats = Stats.set_index("Date")
Stats

            UnitCost  UnitPrice  SalesAmount
Date
01-01-2014     73.12     159.00     1431.000
01-01-2014    509.32     999.00     2847.150
01-01-2014     16.31      32.00      116.800
01-01-2014    105.77     230.00     4128.500
01-01-2014      1.71       3.35      268.000
...              ...        ...          ...
31-12-2016    208.40     629.00     4654.600
31-12-2016    222.98     673.00     3634.200
31-12-2016    123.24     268.00     3269.600
31-12-2016    210.72     635.99    14309.775
31-12-2016    195.24     382.95     4748.580

[859505 rows x 3 columns]

# Central Tendency

Mean-- The average of all the data in our dataframe

In [10]:
numbers = [10,20,30,40,50,60,70,800,-90,45]
#this is the normal math type way for to performing the statistical operations like mean median or mode
mean = sum(numbers)//len(numbers)
mean

103

In [11]:
#Through Stats library
num_2 = [10,13,21,14,15,16,17,18,-19,-1,78.8]
mean = statistics.mean(num_2)
print(mean)

16.618181818181817

Median-- the center most value present in the data that makes 50-50 difference

In [12]:
#traditional or normal math way
num_3 = [80,70,30,10,20,30,40,50,60,30]
num_3.sort(reverse= True)#that is in descending order
#for odd number lengh formulae is different and for even number length formulae is different
print((num_3))
#so this is even 
median = (num_3[len(num_3)//2] + num_3[len(num_3)//2-1])//2
median

[80, 70, 60, 50, 40, 30, 30, 30, 20, 10]

35

In [13]:
#in case of odd number length
num_3.append(70)
print(num_3)

[80, 70, 60, 50, 40, 30, 30, 30, 20, 10, 70]

In [14]:
median_2 = num_3[len(num_3)//2]
print("The median for odd number length is {}".format(median_2))

The median for odd number length is 30

In [15]:
#through statistical library calculation
print(num_3)
statistics.median(num_3) #this is showing different value because statistics module removes the duplicate values

[80, 70, 60, 50, 40, 30, 30, 30, 20, 10, 70]

40

In [16]:
num_4 = [10,10,20,30]
statistics.median(num_4)

15.0

In [17]:
num_3 = [10,20,30,40,50]
statistics.median(num_3)

30

In [18]:
median_2 = num_3[len(num_3)//2]
print(median_2)

30

In [19]:
num_4 = [10,10,20,30,40]
statistics.median(num_4)

20

In [20]:
median_4 = num_4[len(num_4)//2]
print(median_4)

20

Mode-- Most frequently occuring value in our dataset

In [21]:
mode_numbers = [10,10,10,20,30,40]
#traditional way
set(mode_numbers)

{10, 20, 30, 40}

In [22]:
max(set(mode_numbers),key =mode_numbers.count)

10

In [23]:
statistics.mode(mode_numbers)

10

# Standard Deviation

It indicates how your individual data is deviates from the mean of the data set

Low sd means highly clustered data points among the mean and high sd is vice versa for the same

In [24]:
numbers = [10,20,30,40,50,60,70,80,90,100]
mean = statistics.mean(numbers)
sd_1 = statistics.stdev(numbers)
print("The mean of dataset is {} and the sd is {}".format(mean,sd_1))
#here you can see the sd is not too high and when you plot the data points you will see uniform and closely clustered to mean

The mean of dataset is 55 and the sd is 30.276503540974918

In [25]:
#no we what if there is some big number present in the dataset
numbers_2 = [10,20,30,40,50,60,70,80,90,1000,500]
mean = statistics.mean(numbers_2)
sd_2 = statistics.stdev(numbers_2)
print("The mean of dataset is {} and the sd is {}".format(mean,sd_2))

The mean of dataset is 177.27272727272728 and the sd is 305.4207232357002

In [26]:
#now see the low sd example and see how closely data points reduce the sd
numbers_3 = [1,1,2,3,1,2,3,2,1,2,3,1,2]
mean = statistics.mean(numbers_3)
sd_3 = statistics.stdev(numbers_3)
print("The mean of dataset is {} and the sd is {}".format(mean,sd_3))

The mean of dataset is 1.8461538461538463 and the sd is 0.8006407690254357

Variance

In [27]:
#first method 
variance = (statistics.stdev(numbers_2))**2
print("The variance of the given dataset is {}".format(variance))
#second method
print(statistics.variance(numbers_2))

The variance of the given dataset is 93281.81818181819
93281.81818181818

Now we are going to find out the central tendency for our Stats dataframe

In [28]:
Stats.describe()

            UnitCost      UnitPrice    SalesAmount
count  859505.000000  859505.000000  859505.000000
mean      139.869492     333.782285    3780.213527
std       167.488106     429.060293    5317.942758
min         0.480000       0.950000       3.040000
25%        32.250000      69.000000     657.415500
50%        84.840000     188.000000    2080.000000
75%       204.640000     445.000000    4990.000000
max       960.820000    2899.990000  272718.120000

In [29]:
#for to get description for each column
Stats["UnitPrice"].describe()

count    859505.000000
mean        333.782285
std         429.060293
min           0.950000
25%          69.000000
50%         188.000000
75%         445.000000
max        2899.990000
Name: UnitPrice, dtype: float64

In [31]:
St = Stats.SalesAmount #storing all the sales value data in list data type
mean_1 = statistics.mean(St)
Stdev_1 = statistics.stdev(St)
print("The mean for Sales amount is {} and standard deviation is {}".format(mean_1,Stdev_1))

The mean for Sales amount is 3780.213526960634 and standard deviation is 5317.942758136652

# Trying the statistics describe formulae on small dataset

In [33]:
set_1 = [1,1,1,3,2,4,5,4,7]
df_set_1 = pd.DataFrame(set_1)
df_set_1.describe()

              0
count  9.000000
mean   3.111111
std    2.088327
min    1.000000
25%    1.000000
50%    3.000000
75%    4.000000
max    7.000000